---
title: SchemaCommon
classe: Autodesk.Revit.DB.Visual.SchemaCommon
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# SchemaCommon

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String BaseSchema { get; }` | `SchemaCommon.BaseSchema` | String |
| `String Category { get; }` | `SchemaCommon.Category` | String |
| `String Description { get; }` | `SchemaCommon.Description` | String |
| `String Hidden { get; }` | `SchemaCommon.Hidden` | String |
| `String Keyword { get; }` | `SchemaCommon.Keyword` | String |
| `String Thumbnail { get; }` | `SchemaCommon.Thumbnail` | String |
| `String UIName { get; }` | `SchemaCommon.UIName` | String |
| `String VersionGUID { get; }` | `SchemaCommon.VersionGUID` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```